# В отдельном файле, например, main.rb написать код, который:
# Создает тестовые данные (станции, поезда, вагоны) и связывает их между собой.
# Используя созданные в рамках задания методы, написать код, который перебирает последовательно все станции и для каждой станции выводит список поездов в формате:
# - Номер поезда, тип, кол-во вагонов
# А для каждого поезда на станции выводить список вагонов в формате:
# - Номер вагона (можно назначать автоматически), тип вагона, кол-во свободных и занятых мест (для пассажирского вагона) или кол-во свободного и занятого объема (для грузовых вагонов).

# Дополнительное задание:
# - Если у вас есть интерфейс, то добавить возможности:
# - При создании вагона указывать кол-во мест или общий объем, в зависимости от типа вагона
# - Выводить список вагонов у поезда (в указанном выше формате)
# - Выводить список поездов на станции (в указанном выше формате)
# - Занимать место или объем в вагоне